Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/birth_family_relationships/getting_married/religious_marriage_ceremonies.html.txt.tmx
Source language: en
Languages: ga

source: Religious and secular marriage ceremonies
ga: Searmanais an phósta reiligiúnacha agus saolta

source: Since the commencement of Part 6 of the Civil Registration Act 2007 in November 2007, to legally marry you require a Marriage Registration Form (MRF) from a Registrar and whoever is solemnising your marriage must be on the Register of Solemnisers
ga: Tar éis theacht i bhfeidhm Chuid 6 den Acht um Chlárú Sibhialta 2007 i Samhain 2007, chun pósadh go dleathach, tá sé de dhíth ort Foirm Chláraithe Pósta (FCP) a fháil ón gCláraitheoir, agus caithfidh cibé duine atá ag sollúnú do phósadh a bheith ar Chlár na Sollúnóirí

source: The Registrar issues the MRF when you give your 3 month notification to the Registrar
ga: Eisíonn an Cláraitheoir an FCP nuair a thugann tú fógra 3 mhí don Chláraitheoir

source: If you are intend getting married by religious or secular ceremony, you should approach the authorities of the body concerned for advice on how to proceed
ga: Má tá tú ag pósadh trí shearmanas reiligiúnach nó saolta, ba chóir duit teagmháil a dhéanamh le húdaráis an comhlacht lena mbaineann, chun comhairle a fháil maidir leis an gceist a bhogadh ar aghaidh

source: You will be told what requirements that body has in order to get married under their rites
ga: Inseofar duit céard iad na riachtanais atá ag an bhforas ionas gur féidir leat pósadh faoina gcuid deasghnátha

source: While a marriage ceremony can be performed according to the customs and rites of the body, there are certain requirements that must be met in order for the marriage to be legal
ga: Cé gur féidir searmanas pósta reiligiúnach nó saolta a chur ar bun de réir nósanna agus deasghnátha an fhorais reiligiúnaigh nó saolta, tá riachtanais áirithe ann nach mór a chomhlíonadh ionas go mbeidh an pósadh dlíthiúil

source: The person solemnising the marriage must be on the Register of Solemnisers (pdf) which is maintained by the General Registrar
ga: Ní mór don té atá ag sollúnú an phósta a bheith ar Chlár na Sollúnóirí (pdf), atá á choinneáil ag an bPríomh-Chláraitheoir

source: It lists both civil registrars and the members of the various religious and secular bodies who have been nominated by the bodies as solemnisers
ga: Tá liosta ann de na cláraitheoirí sibhialta agus na baill de na forais reiligiúnacha agus saolta éagsúla atá ainmnithe ag na forais mar shollúnóirí

source: It is available for inspection at your local registration office
ga: Is féidir é a scrúdú ag d'oifig clárúcháin áitiúil

source: The ceremony must be performed in the presence of two witnesses aged 18 or over
ga: Caithfidh an searmanas tarlú i láthair beirt fhinnéithe atá 18 bliana d'aois nó os a chionn

source: If you fulfill the 3 months notification requirements and there is no impediment to you getting married, the Registrar will issue you with a Marriage Registration Form (MRF) giving you permission to marry
ga: Má dhéanann tú na riachtanais fógartha 3 mhí a chomhlíonadh agus nach bhfuil aon bhac pósta i gceist, eiseoidh an Cláraitheoir Foirm Chláraithe Pósta (FCP) a thabharfaidh cead pósta duit

source: You should give the MRF to the person who will be solemnising the marriage in advance of the marriage ceremony
ga: Ba chóir duit an FCP a thabhairt don té a bheidh ag sollúnú an phósta roimh an tsearmanais phósta

source: Immediately after the marriage ceremony, the MRF should be signed by you and your spouse, the two witnesses and the person who has solemnised the marriage
ga: Díreach tar éis an tsearmanais phósta, caithfidh FCP a beith sínithe agat féin, ag do chéile, ag an mbeirt fhinnéithe agus ag an té a rinne sollúnú ar an bpósadh

source: The MRF should be returned within one month to a Registrar, for the marriage to be registered
ga: Ba chóir an FCP a sheoladh ar ais chuig Cláraitheoir taobh istigh d'aon mhí amháin, chun go gclárófar an pósadh

source: It does not have to be returned to the Registrar who issued it
ga: Ní gá é a sheoladh ar ais chuig an gCláraitheoir a d'eisigh é

source: While the marriage ceremony can be performed according to the customs and rites of the religious or secular body, as part of the ceremony you and your intended spouse must make two declarations:
ga: Cé gur féidir searmanas an phósta a cheiliúradh de réir chustaim agus deasghnátha an fhorais reiligiúnaigh nó saolta, ní mór duit féin agus don té atá tú ag pósadh dhá dhearbhú a dhéanamh le linn an tsearmanais:

source: • That you do not know of any impediment to the marriage
ga: • Nach bhfuil aon bhac pósta ar eolas agaibh

source: • That you accept each other as husband and wife
ga: • Go nglacann sibh a chéile mar fhear céile agus bean chéile

source: The venue for the ceremony is a matter for the body
ga: Is faoin bhforas atá an cinneadh maidir leis an ionad don tsearmanas

source: According to the legislation the place where the solemnisation takes place must be open to the public
ga: De réir na reachtaíochta, ní mór don áit a bhfuil an sollúnú ar bun a bheith oscailte don phobal

source: This means that access to the venue for the general public must be unrestricted
ga: Ciallaíonn sé seo nach mór don rochtain ar an ionad don phobal go ginearálta a bheith neamhtheoranta

source: If either you, your intended spouse, either of the two witness or the solemniser does not have sufficient knowledge of the language in which the ceremony is being held to understand the ceremony, then the services of an interpreter must be provided
ga: Mura bhfuil dóthain tuisceana agat féin, ag an gcéile beartaithe, nó ag ceachtar den bheirt fhinnéithe nó ag an sollúnóir ar an teanga ina bhfuil an searmanas á thionól ionas gur féidir leo an searmanas a thuiscint, caithfear seirbhísí ateangaire a sholáthar

source: It is your responsibility to provide the services
ga: Is tusa atá freagrach as na seirbhísí a sholáthar
